{"pageProps":{"slug":"cac-minh-tao-animation-reactjs","title":"Cách mình tạo Animation với ReactJS","date":"Tue Mar 08 2022 16:02:02 GMT+0700 (Indochina Time)","description":"Cách mình tạo Animation với ReactJS, CSS Transition, Hook Animate","tags":["Reactjs"],"content":"<h1>Cách mình tạo Animation với ReactJS</h1>\n<h1>Sử dụng CSS</h1>\n<p>Đây là cách mình vẫn thường dùng, để tạo ra animation bạn chỉ cần sử dụng css để thay đổi thuộc tính của phần tử kết hợp với thuộc tính <strong>transition</strong>. Nó có thể giúp mình thực hiện hầu hết các animation cần thiết như fadeIn, fadeOut, slideIn, slideOut,...... Sử dụng CSS chỉ gặp khó khăn khi animation của bạn quá phức tạp, kết hợp nhiều bước hoặc cần tính toán dựa trên tương tác của người dùng. Tuy nhiên việc kết hợp nó với ReactJS giúp cho cách sử dụng này mạnh mẽ hơn rất nhiều.</p>\n<p>Bên duới là một ví dụ đơn giản theo dạng bật tắt và cách mà bạn có thể từ ví dụ này tạo ra các animation của riêng bạn:</p>\n<p><img src=\"https://images.viblo.asia/ed12eb98-371a-4596-ab15-f9f945d77c48.gif\" alt=\"\"></p>\n<p>Một animation đơn giản, khi bạn bấm vào icon tìm kiếm, ô input sẽ hiện ra từ trái qua phải. Bạn có thể xem đoạn code bên dưới để biết cách mình đã làm:\n<img src=\"https://images.viblo.asia/bb1c85a6-daf3-4d7e-9720-e3b852833d63.png\" alt=\"\"></p>\n<p>Ở thẻ Input khi click vào Icon, biến on sẽ thay đổi. Nếu là true thì sẽ thêm class show vào thẻ Input.</p>\n<p><img src=\"https://images.viblo.asia/e186e708-cff0-4283-954c-79172f76082c.png\" alt=\"\"></p>\n<p>Bạn có thể để ý thấy ban đầu Input chỉ có with là 0px sau khi thêm class show nó sẽ là 150px, kết hợp với thuộc tính transition để tạo hiệu ứng bạn đã có một animation nhìn như của Medium ^^</p>\n<p>Nếu bạn chưa biết vầ thuộc tính <strong>transition</strong> thì đây là một thuộc tính chỉ ra khi bạn thay đổi một thuộc tính CSS thì sẽ có thay đổi trong bao lâu và khi nào thay đổi. Cú pháp của nó là:</p>\n<p><img src=\"https://images.viblo.asia/984b03b3-cd5a-4224-b5a2-1e40fb1618d1.png\" alt=\"\"></p>\n<p>Trong ví dụ của mình thì <strong>all</strong> để chỉ  hiệu ứng sẽ diễn ra ở tất cả các thuộc tính, bạn cũng có thể chỉ định thuộc tính cụ thể như width, height, transform, opacity,....... <strong>1s</strong> là khoảng thời gian diễn hiệu ứng. Còn <strong>ease</strong> là timing-function, nó sẽ mô tả cách mà transition sẽ phát triển như thế nào theo thời gian. Ví dụ <strong>ease</strong> nghĩa là bạn sẽ bắt đầu hiệu ứng chậm, rồi nhanh, và lại kết thúc chậm.</p>\n<p>Bạn có thể tìm hiểu thêm về <strong>transition</strong> tại đây <a href=\"https://www.w3schools.com/css/css3_transitions.asp\">https://www.w3schools.com/css/css3_transitions.asp</a></p>\n<p>Cách mà bạn có thể làm các animation theo giống như này:</p>\n<ol>\n<li>Xác định hành động tạo ra animation.</li>\n<li>Phần tử nào của bạn sẽ thay đổi.</li>\n<li>Phần tử đó sẽ thay đổi như nào.</li>\n</ol>\n<p>Trong ví dụ của mình việc người dùng click Icon là hành động tạo ra animation, ngoài ra còn có thể là khi người dùng vừa load trang, gõ bàn phím, cuộn chuột,.... Phần tử thay đổi là ô Input, trong ví dụ của mình thì chỉ đơn giản là ô Input nhưng bạn hoàn toàn có thể tạo ra thay đổi trên nhiều phần tử khác nhau cùng lúc, với ReactJS thì việc này lại khá đơn giản.</p>\n<p>Mình đã thay đổi with của ô Input từ 0px đến 150px. Đây là cách mình thay đổi phần tử. Ngoài ra bạn có thể tìm các thuộc tính CSS mà transition có thể tác động được ở đây <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_animated_properties\">https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_animated_properties</a></p>\n<p>Bạn có thể tự mình làm các ví dụ để hiểu hơn, kết hợp các animation theo ý thích của mình. Việc thực hành từ các ví dụ nhỏ sẽ giúp bạn rất nhiều nếu muốn làm các animation phức tạp và đẹp như trên mạng :)</p>\n<p>Bên dưới là một ví dụ khác mình sử dụng thuộc tính <strong>animation</strong> trong CSS:</p>\n<p><img src=\"https://images.viblo.asia/effb49d2-45ca-4a2e-a7d5-ba1722ab6293.gif\" alt=\"\"></p>\n<h1>Hook animate</h1>\n<p>Khi gặp một số tình huống mà không thể thay đổi được CSS (ví dụ khi muốn cuộn chuột mượt mà) , hoặc cần căn chỉnh thời gian thì mình dùng cách này. Đây chỉ là hook mình tự viết, có khá nhiều thư viện khác sẽ có chức năng tương tự.</p>\n<p><img src=\"https://images.viblo.asia/1ea57251-ae2c-43b8-a961-157da1504b03.png\" alt=\"\"></p>\n<p>Hook nhận vào 2 tham số là:</p>\n<ul>\n<li>Duration: Khoảng thời gian diễn ra hiệu ứng.</li>\n<li>Process: Hàm này sẽ giống như timing-function ở trên, bạn có thể tìm hiểu về <a href=\"https://vi.wikipedia.org/wiki/%C4%90%C6%B0%E1%BB%9Dng_cong_B%C3%A9zier\">đường cong bezier</a>, và thư viện <a href=\"https://github.com/gre/bezier-easing\">bezier-easing</a></li>\n</ul>\n<p>Nó sẽ trả về 3 giá trị:</p>\n<ul>\n<li>Time: khoảng thời gian hiệu ứng đã diễn ra.</li>\n<li>Fraction: Tỷ lệ giữa thời gian đã điễn ra và toàn bộ khoảng thời gian diễn ra hiệu ứng <strong>(time / duration)</strong>.</li>\n<li>Start: Gọi hàm này sẽ bắt đầu chạy hiệu ứng.</li>\n</ul>\n<p>Thật ra thì tuỳ cách sử dụng mà mình sẽ sửa nó cho phù hợp :D</p>\n<h1>Clone một UI Animation trên Pinterest</h1>\n<p>Đây là một hiệu ứng khá đẹp mắt mà mình thấy trên Pinterest. Thấy nó đẹp nên cũng tìm cách làm thử nhưng không được xịn sò bằng ^^</p>\n<p><strong>Hàng thật</strong></p>\n<p><img src=\"https://images.viblo.asia/57250b92-ee66-4ee6-872a-cc276a3d6f82.gif\" alt=\"\"></p>\n<p>Link trên Pinterest: <a href=\"https://www.pinterest.com/pin/843158361471238865/\">https://www.pinterest.com/pin/843158361471238865/</a></p>\n<p><strong>Hàng tự làm</strong></p>\n<p><img src=\"https://images.viblo.asia/38cbc93c-55df-461e-adee-f78f637ec089.gif\" alt=\"\"></p>\n<p>Link trên CodeSandBox: <a href=\"https://codesandbox.io/s/nifty-montalcini-rsu5m\">https://codesandbox.io/s/nifty-montalcini-rsu5m</a></p>\n<p>Mình có sử dụng thư viện <a href=\"https://www.react-spring.io/\">https://www.react-spring.io/</a> để căn chỉnh thời gian. Đây là một thư viện khá nổi tiếng và cung cấp nhiều function tiện ích mà bạn cũng có thể sử dụng...</p>\n<h1>Tổng kết</h1>\n<p>Bài viết là các cách làm của mình khi muốn tạo ra một animation trên ReactJS. Hy vọng có thể giúp đỡ các bạn khi cần làm việc với Animation. :D</p>"},"__N_SSG":true}